[
    {
        "title": "Trump and Musk appear together in the Oval Office to defend the work of DOGE - NPR",
        "source": "NPR",
        "publishedAt": "2025-02-11T23:52:37Z",
        "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F5c%2Ff9bbb3dc48acbddc521db560c8d7%2Fgettyimages-2198395777.jpg",
        "summary": "President Trump and Elon Musk appeared together in the Oval Office to defend their efforts to cut government spending through Musk's Department of Government Efficiency (DOGE) initiative. They claim to have found billions in waste and plan to reduce the federal workforce. The executive order issued provides guidelines for agencies to work with DOGE, limit hiring, and consult with a DOGE Team Lead. The changes do not apply to military personnel and exempt positions related to national security. Legal challenges have arisen against DOGE actions, with federal courts blocking access to sensitive materials. Musk addressed concerns about transparency and conflicts of interest, stating that DOGE actions are posted online.",
        "url": "https://www.npr.org/2025/02/11/nx-s1-5293504/trump-musk-doge-oval-office"
    },
    {
        "title": "Federal Reserve's Jerome Powell says there's no need to rush on interest rate cuts - NPR",
        "source": "NPR",
        "publishedAt": "2025-02-11T22:42:07Z",
        "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7758x4364+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2Fde%2F60bd23ed476ca4e1a2cfd3563d1a%2Fgettyimages-2198936860.jpg",
        "summary": "Federal Reserve Chair Jerome Powell testified that further interest rate cuts are not needed at the moment due to a strong job market and elevated inflation. Powell also addressed questions about President Trump's economic policies and the Fed's bank supervision, emphasizing the need to stay out of politics. Powell mentioned that any future rate cuts will depend on inflation cooling and job market conditions. He also highlighted uncertainties related to Trump's tariff policies potentially affecting inflation and the Fed's ability to lower rates. Powell assured that the Fed will review its bank supervision manual in response to concerns about discouraging banks from working with certain businesses. Senator Elizabeth Warren criticized the Trump administration for effectively shutting down the Consumer Financial Protection Bureau, urging Powell not to support the funding cuts for the agency.",
        "url": "https://www.npr.org/2025/02/11/nx-s1-5293438/federal-reserve-fomc-jerome-powell-interest-rates-inflation"
    },
    {
        "title": "Disney Overhauls DEI Efforts Amid Trump Administration Purge - Deadline",
        "source": "Deadline",
        "publishedAt": "2025-02-11T22:32:00Z",
        "imageUrl": "https://deadline.com/wp-content/uploads/2023/11/MCDMITH_G5004.jpg?w=1024",
        "summary": "Disney has adjusted its diversity, equity, and inclusion efforts to align more closely with business goals and company values. The changes include updating disclaimers on streaming services and shifting focus to belonging and talent strategy. The company aims to create a welcoming and respectful environment for employees and guests, guided by its core values. The adjustments in the executive compensation planning involve a new \"Talent Strategy\" factor alongside existing factors, emphasizing upholding company values, driving business success, and fostering an environment where all employees can thrive.",
        "url": "http://deadline.com/2025/02/disney-dei-diversity-equity-inclusion-president-donald-trump-1236285804/"
    },
    {
        "title": "White House announces wrongfully detained American teacher Marc Fogel released from Russia in an ‘exchange’ - CNN",
        "source": "CNN",
        "publishedAt": "2025-02-11T21:39:00Z",
        "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/220726162857-01-marc-fogel.jpg?c=16x9&q=w_800,c_fill",
        "summary": "American teacher Marc Fogel, who was detained in Russia for over three years, was welcomed back to the US by President Donald Trump after a successful release negotiation. Fogel expressed gratitude and emotion upon his return. The release was part of an exchange deal with Russia, aimed at showing good faith in ending the war in Ukraine. Fogel's family and government officials praised Trump for securing his release. The details of the exchange were not fully disclosed, but another American's release is expected. Fogel, a history teacher, was arrested in Russia in 2021 for carrying cannabis to treat his spinal pain. His family had raised concerns about his health during his detention. The release was facilitated by Trump's team and involved various diplomatic efforts.",
        "url": "https://www.cnn.com/2025/02/11/politics/marc-fogel-released-russia-trump/index.html"
    },
    {
        "title": "Trump stands by his Gaza plan in meeting with Jordan’s King Abdullah - CNN",
        "source": "CNN",
        "publishedAt": "2025-02-11T20:18:00Z",
        "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/20250210-trump-abdullah-ii-split.jpg?c=16x9&q=w_800,c_fill",
        "summary": "President Trump reiterated his proposal to relocate Palestinians in Gaza and redevelop the land into premium housing, despite opposition from Arab leaders like King Abdullah II of Jordan. Trump suggested moving Palestinians to \"parcels\" in third countries, including Jordan. Abdullah expressed discomfort with the plan and emphasized the importance of finding a solution beneficial for all parties. Trump is serious about his plan, which involves Egypt and Jordan accepting millions of Palestinian refugees. He hinted at using American aid as leverage but later backtracked on threatening to withhold aid. The proposal has raised concerns about destabilizing security partners and the region. Trump's plan lacks support from Arab countries and faces challenges in implementation.",
        "url": "https://www.cnn.com/2025/02/11/politics/trump-jordan-king-abdullah-gaza-plan/index.html"
    },
    {
        "title": "Judge orders CDC, FDA to restore websites taken down after Trump gender order - The Washington Post",
        "source": "The Washington Post",
        "publishedAt": "2025-02-11T19:06:54Z",
        "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FZ5BTKDQJNMVEACV2IZY4L5X7U.JPG&w=1440",
        "summary": "A federal judge has ordered premier health agencies to restore online access to websites monitoring HIV, health risks for youths, and assisted reproductive technologies.",
        "url": "https://www.washingtonpost.com/dc-md-va/2025/02/11/judge-orders-cdc-websites-restored/"
    }
]